dataset_gen/CE_datasets/FPO_cylinder/Regular/Design_Point_0/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/rho";
    object      rho;
}

dimensions      [1 -3 0 0 0 0 0];
// For example, if you expect (p, T) such that:
// p = 101325 Pa, T = 300 K, and using R ≈ 287 J/(kg·K) for air,
// then rho = p / (R * T) ≈ 1.176 kg/m^3.
internalField   uniform 1.176;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
